app/controllers/admin/posts_controller.rb

    def destroy
      Post.find(params[:id]).destroy
---
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]