app/controllers/admin/users_controller.rb

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def destroy
      User.find(params[:id]).destroy