app/controllers/api/v1/comments_controller.rb

  def create

    post = Post.find(params[:post_id])
    parsed_comment = JSON.parse(request.body.read)
    comment = Comment.new(body: parsed_comment["body"])
    comment.user = current_user
    comment.post = post

    if current_user.nil?
      render status: 401
    elsif comment.save
      flash[:notice] = 'Comment Added Successfully'
      render json: post.comments
    else
      flash[:alert] = comment.errors.full_messages.join(", ")
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "add this"], ["user_id", 3], ["post_id", 2], ["created_at", "2018-02-05 19:27:43.038545"], ["updated_at", "2018-02-05 19:27:43.038545"]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 2]]