app/controllers/api/v1/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    render json: Post.all

INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Second post"], ["content", "pleseeeaserawe workd"], ["user_id", 3], ["created_at", "2018-02-05 19:38:24.943126"], ["updated_at", "2018-02-05 19:38:24.943126"]]
---
  def create

    post = Post.new(post_params)
    post.user = current_user

    if current_user.nil?
      render status: 401
    elsif post.save