app/controllers/api/v1/users_controller.rb

  def update
    @user = User.find(params[:id])
    geo=MultiGeocoder.geocode(user_params[:location])
    new_attributes=user_params
    new_attributes[:lat]=geo.lat
    new_attributes[:lng]=geo.lng
    binding.pry
    if @user.update_attributes(new_attributes)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 10], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "location" = $2, "moto" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["username", "TEst"], ["location", "Boston, MA"], ["moto", "test"], ["updated_at", "2018-02-15 21:11:07.987317"], ["id", 10]]