app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "tags", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @post = Post.new(post_params)
    @post.user = current_user

    if @post.save